Revit 2024 API
ProgressChangedEventArgs Members
The ProgressChangedEventArgs type exposes the following members.
Methods
Name | Description
Cancel
 Requests to cancel the progress bar's operation.
Dispose |  (Inherited from RevitAPIEventArgs.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from RevitAPIEventArgs.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
Caption
 The text from the progress bar caption that describes the operation in progress
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
LowerRange
 Lower part of progress bar range - always zero
Position
 Progress bar position - value is always between zero and upperRange and is incremented by one with each event of stage "PositionChanged"
Stage
 The current stage of the progress bar
UpperRange
 Upper part of progress bar range - will be any non-zero number
See Also
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace